<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="PILLONI Lucien">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.01 [en] (Win95; I) [Netscape]">
   <TITLE>Gravitation, aide</TITLE>
</HEAD>
<BODY TEXT="#FFFFCC" BGCOLOR="#000000" LINK="#FFCC00" VLINK="#FFFF00" ALINK="#FF0000" BACKGROUND="file:///C|/DILP32/Economiseurs/Gravitation/help/Fond.gif">
&nbsp;
<TABLE BORDER COLS=1 WIDTH="100%" >
<TR>
<TD BACKGROUND="FondTable.gif">
<CENTER>
<H1>
<FONT COLOR="#3333FF">Economiseur d'&eacute;cran Gravitation</FONT></H1></CENTER>
</TD>
</TR>
</TABLE>

<CENTER>&nbsp;</CENTER>

<CENTER><IMG SRC="Toutes64.gif" HEIGHT=62 WIDTH=346></CENTER>

<CENTER>&nbsp;</CENTER>
Cet &eacute;conomiseur d'&eacute;cran simule la gravitation universelle
s'appliquant entre des corps c&eacute;lestes. Devant vos yeux, se cr&eacute;ent
et se d&eacute;truisent des plan&egrave;tes et des syst&egrave;mes solaires.
Les corps c&eacute;lestes entrent en collision, explosant en petits morceaux,
ou cr&eacute;ant un nouveau corps plus gros qui se transformera peut &ecirc;tre
en &eacute;toile.

<P>Vous n'avez pas moins de 6 pages de param&egrave;tres pour ajuster votre
univers &agrave; vos d&eacute;sirs.
<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><FONT COLOR="#FF0000">Table
des mati&egrave;res</FONT></H2>

<UL>
<LI>
<A HREF="#Caractéristiques techniques">Caract&egrave;ristiques techniques</A></LI>

<LI>
<A HREF="#Configuration">Configuration</A></LI>

<UL>
<LI>
<A HREF="#Onglet Informations">Onglet "Information"</A></LI>

<LI>
<A HREF="#Onglet Nombres">Onglet "Nombres"</A></LI>

<LI>
<A HREF="#Onglet Création">Onglet "Cr&eacute;ation"</A></LI>

<LI>
<A HREF="#Onglet Physique">Onglet "Physique"</A></LI>

<LI>
<A HREF="#Onglet Comètes">Onglet "Com&egrave;tes"</A></LI>

<LI>
<A HREF="#Onglet Masses">Onglet "Masses"</A></LI>

<LI>
<A HREF="#Onglet Affichage">Onglet "Affichage"</A></LI>
</UL>

<LI>
<A HREF="#Version Shareware.">Version Shareware</A></LI>

<LI>
<A HREF="#Version Enregistrée.">Version Enregistr&eacute;e</A></LI>

<LI>
<A HREF="#Comment acquérir la version enregistrée">Comment commander la
version enregistr&eacute;e.</A></LI>
</UL>

<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><A NAME="Caractéristiques techniques"></A><FONT COLOR="#FF0000">Caract&eacute;ristiques
techniques</FONT></H2>
Gravitation utilise des formules math&eacute;matiques r&eacute;elles pour
simuler la force de gravit&eacute; entre tous les corps c&eacute;lestes.
Vous avez la possibilit&eacute; d'utiliser un mod&egrave;le physique &agrave;
<UL><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>2 deux dimensions. Ce mod&egrave;le
est plus rapide, mais moins r&eacute;aliste.
<BR><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>3 dimensions. Ce mod&egrave;le
est plus r&eacute;aliste, mais moins rapide.</UL>

<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><A NAME="Configuration"></A><FONT COLOR="#FF0000">Configuration</FONT></H2>

<UL>La configuration de ce programme est extr&egrave;menent souple, vous
disposez d'une foule de param&egrave;tres.
<BR>Pour acc&eacute;der &agrave; la fen&ecirc;tre de configuration, ouvrez
la fen&ecirc;tre de Propri&eacute;t&eacute;s du Bureau en cliquant sur
le bureau de Windows avec le bouton droit de la souris. Choisissez l'onglet
des &eacute;conomiseurs d'&eacute;cran. S&eacute;lectionnez "Gravitation"
dans la liste de vos &eacute;conomiseurs d'&eacute;cran. Vous obtenez imm&eacute;diatement
un aper&ccedil;u de l'aspect de l'&eacute;conomiseur.
<BR>Cliquez sur le bouton "Param&egrave;tres" pour ouvrir la fen&ecirc;tre
de configuration de Gravitation.
<BR>La fen&ecirc;tre de configuration de Gravitation contient six onglets
repr&eacute;sentant six pages de param&egrave;tres.

<P>Un conseil, modifier chaque param&egrave;tre prudemment, un par un,
certains peuvent avoir une tr&egrave;s grand influence sur le comportement
du programme et vous amener des syst&egrave;mes solaires compl&egrave;tement
instables.</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Informations"></A>Onglet
"Informations"</H3>

<UL>Cette page vous donne quelques informations g&eacute;n&eacute;rales
sur le programme.</UL>
&nbsp;
<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Nombres"></A>Onglet
"Nombres"</H3>

<UL>Cette page vous laisse le choix du nombre de plan&egrave;tes que le
programme g&egrave;rera.
<BR><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Nombre minimum:&nbsp;&nbsp;&nbsp;
Quand les collisions successives ne laissent plus suffisament de corps,
un nouveau syst&egrave;me est g&eacute;n&eacute;r&eacute;.
<BR><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Nombre initial:&nbsp;&nbsp;&nbsp;
Nombre de corps c&eacute;leste cr&eacute;&eacute;s pour chaque nouveau
syst&egrave;me.
<BR><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Nombre maximal:&nbsp;&nbsp;&nbsp;
Le nombre maximum de corps que le programme g&egrave;rera. Des collisions
peuvent cr&eacute;er de nouveaux corps.
<BR><FONT COLOR="#FF6666">ATTENTION </FONT>! Le calcul de gravit&eacute;
augmente avec le <B><FONT COLOR="#FF0000">carr&eacute;</FONT></B> du nombre
de corps.</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Création"></A>Onglet
"Cr&eacute;ation"</H3>

<UL>Cette page vous permet de choisir la position et la vitesse initiale
des corps c&eacute;lestes. Le programme est capable de placer les corps
sur des orbites circulaires autour d'autre corps.

<P>Vous pouvez &eacute;galement choisir entre le mod&egrave;le physique
2D et 3D. Sachez cependant que l'affichage ne se fera en aucun cas en trois
dimensions. J'ai voulu garder un affichage le plus fluide possible. Cependant,
en 3 dimensions, les corps les plus &eacute;loign&eacute;s passeront derri&egrave;re
les corps les plus proches ( appelont &ccedil;a 2D 1/2 )..</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Physique"></A>Onglet
"Physique"</H3>

<UL>Cette page vous permet de r&eacute;gler le mod&egrave;le physique utilis&eacute;
par le programme. ATTENTION ! Certains param&egrave;tres sont difficiles
&agrave; r&eacute;gler et le programme ne peut pas faire tous les contr&ocirc;les.
Certaines valeurs peuvent provoquer des plantages, allez y prudemment.
Essayez de ne modifier qu'un param&egrave;tre &agrave; la fois.
<BR>&nbsp;
<CENTER><TABLE BORDER CELLSPACING=0 CELLPADDING=0 WIDTH="100%" >
<TR VALIGN=TOP>
<TD VALIGN=TOP WIDTH="20%"><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Constante
de gravit&eacute; (G)</TD>

<TD>Ce param&egrave;tre permet de r&eacute;gler l'intensit&eacute; de la
force de gravitation qui s'exerce entre les corps.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Mult. de temps&nbsp;</TD>

<TD>Permet d'acc&eacute;l&eacute;rer ou de ralentir le temps pour une animation
plus rapide.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Mult. de distance&nbsp;</TD>

<TD>Permet de r&eacute;gler la relation entre les distance &agrave; l'&eacute;cran
( en pixels ) et les distances dans le mod&egrave;le physique. Sachez que
la force de gravit&eacute; d&eacute;croit avec le <B>carr&eacute; </B>de
la distance. La taille visible des corps c&eacute;lestes ne varie pas.</TD>
</TR>

<TR VALIGN=TOP>
<TD VALIGN=TOP><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Mult.
de rayon :&nbsp;</TD>

<TD>Ce param&egrave;tre est utilis&eacute; pour les calculs de collision.
Diminuez le pour permettre aux corps de s'approcher plus pr&egrave;s les
uns des autres.</TD>
</TR>

<TR VALIGN=TOP>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Pourcent de vitesse
de lib&eacute;ration :</TD>

<TD VALIGN=TOP>Quand un corps c&eacute;leste s'&eacute;loigne trop du corps
central, le programme calcule sa vitesse de lib&eacute;ration (pond&eacute;r&eacute;e
par ce pourcentage ) pour d&eacute;terminer si ce corps doit &ecirc;tre
consid&eacute;r&eacute; comme perdu dans l'espace. Un coefficient trop
proche de 100 aura pour consequence que des corps &eacute;loign&eacute;s
reviendront apr&egrave;s une TRES longue p&eacute;riode de temps.</TD>
</TR>

<TR VALIGN=TOP>
<TD VALIGN=TOP><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24 ALIGN=TEXTTOP>Vitesse
de collision max</TD>

<TD>Quand deux corps de masse proche entrent en collision, l'effet produit
d&eacute;pend de leur vitesse de rencontre. Si celle-ci est suffisament
faible, les deux corps s'agglom&egrave;rent pour former un corps plus lourd.
Sinon, ils explosent en une multitude de fragments plus petits.</TD>
</TR>
</TABLE></CENTER>
&nbsp;</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Comètes"></A>Onglet
"Com&egrave;tes"</H3>

<UL>Cette page permet de r&eacute;gler les param&egrave;tres des com&egrave;tes.
Les com&egrave;tes sont des corps c&eacute;lestes pourvu d'une chevelure
form&eacute;e par les gaz et poussi&egrave;res qui s'en &eacute;chappent
que elle s'approche d'une &eacute;toile. Cette chevelure est repouss&eacute;e
par le vent solaire. Ces param&egrave;tres ont surtout une influence sur
l'affichage.</UL>

<UL>
<UL>
<LI>
Vent solaire :&nbsp;&nbsp;&nbsp; Intensit&eacute; du vent solaire, d&eacute;termine
la longueur de la chevelure.</LI>

<LI>
1/fr&eacute;quence de cr&eacute;ation:&nbsp;&nbsp;&nbsp; Quand le nombre
de corps devient relativement faible, le programme g&eacute;n&egrave;re
al&eacute;atoirement des com&egrave;tes. Plus ce param&egrave;tre est grand,
plus la fr&eacute;quence de cr&eacute;ation de com&egrave;tes est faible.</LI>

<LI>
Nb. Max de poussi&egrave;res : nombre maximum de grains de poussi&egrave;res
g&eacute;r&eacute;s simultan&eacute;ment par le programme.</LI>

<LI>
Taille max des grains :&nbsp;&nbsp;&nbsp; taille maximum de chaque grain
de poussi&egrave;re ( en pixels ).</LI>

<LI>
Dur&eacute;e de vie des grains : nombre de secondes qu'un grain de poussi&egrave;re
reste visible &agrave; l'&eacute;cran</LI>

<LI>
% de dispersion des poussi&egrave;res : pourcentage MOYEN de dispersion
des grains de poussi&egrave;re &agrave; partir d'une com&egrave;te.</LI>
</UL>
</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Masses"></A>Onglet
"Masses"</H3>

<UL>Cette page permet de r&eacute;gler la masse minimale de chaque type
de corps. Quand un corps change de masse ( apr&egrave;s une collision );
sa nouvelle repr&eacute;sentation est choisie en fonction des masses saisies
dans cette page.
<BR>ATTENTION ! Il convient g&eacute;n&eacute;ralement de r&eacute;gler
la constante de gravit&eacute; quand on modifie les masses pour garder
une animation int&eacute;ressante.</UL>

<H3>
<IMG SRC="Deux.gif" HEIGHT=28 WIDTH=28 ALIGN=TEXTTOP><A NAME="Onglet Affichage"></A>Onglet
"Affichage"</H3>

<UL>Cette page vous permet de r&eacute;gler les propri&eacute;t&eacute;s
d'affichage du programme. Les curseurs vous permettent de choisir dans
les plages de valeurs possibles ( les valeurs les plus hautes sont obtenues
en dirigeant le curseur vers la droite ).
<BR>&nbsp;
<TABLE BORDER CELLSPACING=0 CELLPADDING=0 WIDTH="100%" >
<TR VALIGN=TOP>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Images par seconde</TD>

<TD>Nombre de fois par secondes ou le calcul du mod&egrave;le physique
est interrompu pour afficher une image. Cette valeur doit rester autour
de 25 images par seconde pour garder une fluidit&eacute; agr&eacute;able.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Vitesse de travelling</TD>

<TD>Vitesse &agrave; laquelle la cam&eacute;ra se d&eacute;place pour suivre
l'astre le plus lourd du syst&egrave;me.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Facteur de zoom max</TD>

<TD>Grossissement maximum. Les images des plan&egrave;tes gardent la m&ecirc;me
taille, c'est la relation entre les distances physiques et les distances
&agrave; l'&eacute;cran qui sont modifi&eacute;es. Ce param&egrave;tre
fonctionne avec le multiplicateur de distance.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Densit&eacute; du champ d'&eacute;toiles</TD>

<TD>Densit&eacute; d'&eacute;toiles affich&eacute;es en arri&egrave;re
plan.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Afficher le rep&egrave;re</TD>

<TD>Permet d'afficher un cadrillage centr&eacute; sur l'astre le plus lourd.
Ce cadrillage suis aussi le zoom.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Effacer les trajectoires</TD>

<TD>Cette option permet d'effacer ou non les trajectoires des plan&egrave;tes.
Garder les trajectoires peut &ecirc;tre utile pour mieux visualiser les
orbites.</TD>
</TR>

<TR>
<TD><IMG SRC="Trois.gif" HEIGHT=26 WIDTH=24>Changer de r&eacute;solution
d'&eacute;cran</TD>

<TD BACKGROUND="FondTable.gif">Cette option permet au programme d'essayer
une meilleure r&eacute;solution d'&eacute;cran. Certaines cartes vid&eacute;os
provoque un arr&ecirc;t imm&eacute;diat de l&eacute;conomiseur d'&eacute;cran
quand on modifie la r&eacute;solution. Si tel est le cas pour votre machine,
vous devez d&eacute;cocher cette option.</TD>
</TR>
</TABLE>
&nbsp;</UL>

<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><A NAME="Version Shareware."></A><FONT COLOR="#FF0000">Version
Shareware.</FONT></H2>
Ce programme est distribu&eacute; comme logiciel SHAREWARE, c'est &agrave;
dire que vous pouvez l'essayer et le distribuer gratuitement. Si vous d&eacute;cidez
de l'utiliser, vous devez acqu&eacute;rir la version enregistr&eacute;e
qui vous donnera acc&egrave;s &agrave; toutes les fonctionnalit&eacute;s.
<BR>Cette version est v&eacute;rouill&eacute;e par une clef personnelle
g&eacute;n&eacute;r&eacute;e &agrave; l'installation du logiciel. A cette
clef de v&eacute;rouillage correspond une clef de d&eacute;verouillage
que vous obtenez en achetant la version enregistr&eacute;e.
<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><A NAME="Version Enregistrée."></A><FONT COLOR="#FF0000">Version
Enregistr&eacute;e.</FONT></H2>
La version enregistr&eacute;e vous donne acc&egrave;s &agrave; toutes les
fonctionnalit&eacute;s du programme. Vous devez l'acqu&eacute;rir si vous
d&eacute;cidez de l'utiliser.
<BR>La version enregistr&eacute;e comporte une license d'utilisation pour
une seule machine ainsi que toutes les nouvelles versions gratuitement
pendant un an &agrave; compter de la date d'envoi de la clef de d&eacute;verouillage.
<H2>
<IMG SRC="Un.gif" HEIGHT=31 WIDTH=33 ALIGN=TEXTTOP><A NAME="Comment acquérir la version enregistrée"></A><FONT COLOR="#FF0000">Comment
acqu&eacute;rir la version enregistr&eacute;e</FONT></H2>
La version enregistr&eacute;e est disponible pour 75 F par ch&egrave;que,
esp&egrave;ces ou virement bancaire &agrave; l'adresse suivante :
<BR>LUCIEN PILLONI
<BR>110 rue du 8 mai 1945
<BR>38920 Crolles
<BR>FRANCE

<P>e-mail :&nbsp;&nbsp;&nbsp; <A HREF="mailto:pilloni@isl.fr">pilloni@isl.fr</A>

<P>N'oubliez pas de joindre votre clef personnelle de v&eacute;rouillage.
Vous recevrez par retour votre clef personnelle de d&eacute;verrouillage
qui vous donnera acc&egrave;s &agrave; toutes les fonctionnalit&eacute;s
du logiciel.
<BR>&nbsp;
</BODY>
</HTML>
